Revit 2026 API

# ElementPhaseStatusFilter(ElementId, ICollectionElementOnPhaseStatus) Constructor

---

Initializes a new instance of the ElementPhaseStatusFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementPhaseStatusFilter(
	ElementId phaseId,
	ICollection<ElementOnPhaseStatus> phaseStatuses
)
```
```vb
Public Sub New (
	phaseId As ElementId,
	phaseStatuses As ICollection(Of ElementOnPhaseStatus)
)
```
```cpp
public:
ElementPhaseStatusFilter(
	ElementId^ phaseId,
	ICollection<ElementOnPhaseStatus>^ phaseStatuses
)
```
```fsharp
new :
        phaseId : ElementId *
        phaseStatuses : ICollection<ElementOnPhaseStatus> -> ElementPhaseStatusFilter
```

#### Parameters

phaseId ElementId

phaseStatuses ICollectionElementOnPhaseStatus

#### Reference

ElementPhaseStatusFilter Class

ElementPhaseStatusFilter Overload

Autodesk.Revit.DB Namespace